espressif/arduino-esp32/variants/uPesy_esp32c3_mini/pins_arduino.h
#ifndef Pins_Arduino_h
#define Pins_Arduino_h

#include <stdint.h>

#define USB_VID 0x303A
#define USB_PID 0x819B
#define USB_MANUFACTURER "uPesy Electronics"
#define USB_PRODUCT "uPesy ESP32C3 Mini"
#define USB_SERIAL ""

#define EXTERNAL_NUM_INTERRUPTS 22
#define NUM_DIGITAL_PINS        22
#define NUM_ANALOG_INPUTS       6

static const uint8_t TX = 21;
static const uint8_t RX = 20;

static const uint8_t SDA = 3;
static const uint8_t SCL = 10;

static const uint8_t SS    = 7;
static const uint8_t MOSI  = 6;
static const uint8_t MISO  = 5;
static const uint8_t SCK   = 4;

static const uint8_t A0 = 0;
static const uint8_t A1 = 1;
static const uint8_t A3 = 3;
static const uint8_t A4 = 4;
static const uint8_t A5 = 5;

static const uint8_t VBAT_SENSE = 0;

#endif /* Pins_Arduino_h */
